docs/docs.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-14 Tue 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ricardo Vela" />
</head>
<body>
<div id="content">
<h1 class="title">Docs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb7cc1a4">1. Objetos</a>
<ul>
<li><a href="#org862e590">1.1. Padre</a></li>
<li><a href="#orged58583">1.2. Hijo</a></li>
<li><a href="#orgb5a7038">1.3. Entrenador</a></li>
<li><a href="#org156ab1d">1.4. Equipo</a></li>
<li><a href="#orgadb85de">1.5. Evento</a></li>
<li><a href="#org46ca6d9">1.6. Admin</a></li>
<li><a href="#org3b69e6f">1.7. User</a></li>
</ul>
</li>
<li><a href="#org6186df9">2. API</a>
<ul>
<li><a href="#org26e694b">2.1. Funciones</a>
<ul>
<li><a href="#org94ab78b">2.1.1. Registro</a></li>
<li><a href="#orgc3fd9ae">2.1.2. Dashboard General</a></li>
<li><a href="#orgb9fe9b4">2.1.3. Dashboard Usuario</a></li>
<li><a href="#orgf672301">2.1.4. Dashboard Entrenador</a></li>
<li><a href="#orgc3cc730">2.1.5. Dashboard Admin</a></li>
</ul>
</li>
<li><a href="#org761f870">2.2. Endpoints</a>
<ul>
<li><a href="#orgcdd6147">2.2.1. Usuario</a></li>
<li><a href="#org8d8361f">2.2.2. Administrador</a></li>
<li><a href="#org8e4f6f7">2.2.3. Entrenador</a></li>
<li><a href="#org323037d">2.2.4. Events</a></li>
<li><a href="#org3c54383">2.2.5. Padres</a></li>
<li><a href="#org5e742c7">2.2.6. Equipo</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7cc1a4" class="outline-2">
<h2 id="orgb7cc1a4"><span class="section-number-2">1</span> Objetos</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org862e590" class="outline-3">
<h3 id="org862e590"><span class="section-number-3">1.1</span> Padre</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-js">Padre = {
    id,
    nombre,
    correo,
    telefono,
    hijos: [ Hijo ]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orged58583" class="outline-3">
<h3 id="orged58583"><span class="section-number-3">1.2</span> Hijo</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-js">Hijo = {
    nombre,
    equipo,
    asistencias
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5a7038" class="outline-3">
<h3 id="orgb5a7038"><span class="section-number-3">1.3</span> Entrenador</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-js">Entrenador = {
    id,
    nombre,
    correo,
    telefono,
    equipo
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org156ab1d" class="outline-3">
<h3 id="org156ab1d"><span class="section-number-3">1.4</span> Equipo</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-js">Equipo = {
    colorLetra,
    colorFondo,
    eventos = [ Eventos ],
    inicioTemporada = date,
    finTemporada = date,
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgadb85de" class="outline-3">
<h3 id="orgadb85de"><span class="section-number-3">1.5</span> Evento</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #6f7787;">// </span><span style="color: #6f7787;">Podemos pensar en mostrar los eventos por si mismos, sin</span>
<span style="color: #6f7787;">// </span><span style="color: #6f7787;">necesariamente tener que pensar en la semana</span>
Evento = {
    id,
    nombre,
    lugar,
    hora,
    duracion,
    comentarios
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org46ca6d9" class="outline-3">
<h3 id="org46ca6d9"><span class="section-number-3">1.6</span> Admin</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-js">Admin = {
    id,
    correo
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b69e6f" class="outline-3">
<h3 id="org3b69e6f"><span class="section-number-3">1.7</span> User</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-js">User = {
    id, <span style="color: #6f7787;">// </span><span style="color: #6f7787;">igual al id de persona, padre, entrenador o admin</span>
    correo,
    contrase&#241;a
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6186df9" class="outline-2">
<h2 id="org6186df9"><span class="section-number-2">2</span> API</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org26e694b" class="outline-3">
<h3 id="org26e694b"><span class="section-number-3">2.1</span> Funciones</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Las funciones del API están descritas según las vistas de la página
</p>
</div>
<div id="outline-container-org94ab78b" class="outline-4">
<h4 id="org94ab78b"><span class="section-number-4">2.1.1</span> Registro</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orga7db282"></a><b>createParent(Padre) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-1-1">
<ul class="org-ul">
<li>Does not exist and is successful</li>
<li>Does not exist but failed</li>
<li>Already exists</li>
</ul>
</div>
</li>
<li><a id="org63d6938"></a><b>createCoach(Entrenador) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-1-2">
<ul class="org-ul">
<li>Does not exist and is successful</li>
<li>Does not exist but failed</li>
<li>Already exists</li>
</ul>
</div>
</li>
<li><a id="orga35dbea"></a><b>createTeam(Team) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-1-3">
<ul class="org-ul">
<li>Does not exist and is successful</li>
<li>Does not exist but failed</li>
<li>Already exists</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc3fd9ae" class="outline-4">
<h4 id="orgc3fd9ae"><span class="section-number-4">2.1.2</span> Dashboard General</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Estas son funciones que son comunes al dashboard de usuario y entrenador
</p>
</div>
<ol class="org-ol">
<li><a id="org1d45fe5"></a><b>authPerson(email, password) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-2-1">
<ul class="org-ul">
<li>Success: personId</li>
<li>Failure: other code (negative number, for example)</li>
</ul>
</div>
</li>
<li><a id="org205f9cb"></a><b>getParent(parentId) =&gt; Parent || Null</b><br /></li>
<li><a id="org54b13d8"></a><b>getCoach(coachId) =&gt; Coach || Null</b><br /></li>
<li><a id="orgf10e8ca"></a><b>getTeam(teamId) =&gt; Team || Null</b><br /></li>
<li><a id="org1fecfda"></a><b>getNextEvents(currentEventId) =&gt; [ Event ]</b><br />
<div class="outline-text-5" id="text-2-1-2-5">
<ul class="org-ul">
<li>Guard against first event</li>
</ul>
</div>
</li>
<li><a id="org287038b"></a><b>getPreviousEvents(currentEventId) =&gt; [ Event ]</b><br />
<div class="outline-text-5" id="text-2-1-2-6">
<ul class="org-ul">
<li>Guard against last event</li>
</ul>
</div>
</li>
<li><a id="org12e7ab5"></a><b>getTelephoneDirectory(teamId) -&gt; [ Person ]</b><br />
<div class="outline-text-5" id="text-2-1-2-7">
<ul class="org-ul">
<li>Failure: empty list</li>
<li>Success: [ Person ]</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb9fe9b4" class="outline-4">
<h4 id="orgb9fe9b4"><span class="section-number-4">2.1.3</span> Dashboard Usuario</h4>
</div>
<div id="outline-container-orgf672301" class="outline-4">
<h4 id="orgf672301"><span class="section-number-4">2.1.4</span> Dashboard Entrenador</h4>
<div class="outline-text-4" id="text-2-1-4">
</div>
<ol class="org-ol">
<li><a id="orgffff5cb"></a>Configuración<br /></li>
</ol>
</div>
<div id="outline-container-orgc3cc730" class="outline-4">
<h4 id="orgc3cc730"><span class="section-number-4">2.1.5</span> Dashboard Admin</h4>
<div class="outline-text-4" id="text-2-1-5">
</div>
<ol class="org-ol">
<li><a id="org3cf4c37"></a><b>deleteAccount(accountId) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-5-1">
<ul class="org-ul">
<li>Does not exist</li>
<li>Success</li>
<li>Failure</li>
</ul>
</div>
</li>
<li><a id="orgf0d4d4a"></a><b>deleteParent(parentId) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-5-2">
<ul class="org-ul">
<li>Does not exist</li>
<li>Exists, success</li>
<li>Exists, failure</li>
</ul>
</div>
</li>
<li><a id="org4aa0cba"></a><b>deleteAdmin(adminId) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-5-3">
<ul class="org-ul">
<li>Does not exist</li>
<li>Exists, success</li>
<li>Exists, failure</li>
</ul>
</div>
</li>
<li><a id="orga7bd9c2"></a><b>deleteCoach(coachId) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-5-4">
<ul class="org-ul">
<li>Does not exist</li>
<li>Exists, success</li>
<li>Exists, failure</li>
</ul>
</div>
</li>
<li><a id="orgf768051"></a><b>deleteTeam(teamId) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-5-5">
<ul class="org-ul">
<li>Does not exist</li>
<li>Exists, success</li>
<li>Exists, failure</li>
</ul>
</div>
</li>
<li><a id="orgf58ef7d"></a><b>deleteEvent(EventId) =&gt; Result Code</b><br />
<div class="outline-text-5" id="text-2-1-5-6">
<ul class="org-ul">
<li>Does not exist</li>
<li>Exists, success</li>
<li>Exists, failure</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org761f870" class="outline-3">
<h3 id="org761f870"><span class="section-number-3">2.2</span> Endpoints</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgcdd6147" class="outline-4">
<h4 id="orgcdd6147"><span class="section-number-4">2.2.1</span> Usuario</h4>
<div class="outline-text-4" id="text-2-2-1">
<dl class="org-dl">
<dt>POST   /Register:</dt><dd>Registrar nuevo usuario</dd>
<dt>POST   /RegisterGoogle:</dt><dd>Registrar nuevo usuario con cuenta de Google</dd>
<dt>DELETE /DeleteAccount:</dt><dd>Borrar mi Cuenta</dd>
<dt>POST   /LogIn:</dt><dd>Hacer login</dd>
<dt>POST   /Login:</dt><dd>Hacer login con Google</dd>
<dt>PUT    /Info:</dt><dd>Editar información personal</dd>
</dl>
</div>
</div>
<div id="outline-container-org8d8361f" class="outline-4">
<h4 id="org8d8361f"><span class="section-number-4">2.2.2</span> Administrador</h4>
<div class="outline-text-4" id="text-2-2-2">
<dl class="org-dl">
<dt>POST   /:</dt><dd>registra nuevos Admin.</dd>
<dt>DELETE /Coach:</dt><dd>borrar algun Admin</dd>
</dl>
</div>
</div>
<div id="outline-container-org8e4f6f7" class="outline-4">
<h4 id="org8e4f6f7"><span class="section-number-4">2.2.3</span> Entrenador</h4>
<div class="outline-text-4" id="text-2-2-3">
<dl class="org-dl">
<dt>POST   /Invitation:</dt><dd>genera una nueva invitación</dd>
<dt>PUT    /InvitationStatus:</dt><dd>Actualizar el estatus de invitación (Aceptada/Rechazada)</dd>
<dt>PUT    /Season:</dt><dd>Modifica el inicio y fin de una temporada</dd>
<dt>PUT    /TeamColors:</dt><dd>Modifica los colores del equipo para desplegarlos en el ui</dd>
<dt>PUT    /Contact:</dt><dd>Modifica información de contacto</dd>
<dt>POST   /Coach:</dt><dd>registra nuevo entrenador (Administrador).</dd>
<dt>DELETE / Coach:</dt><dd>borrar algun entrenador (Administrador)</dd>
</dl>
</div>
</div>
<div id="outline-container-org323037d" class="outline-4">
<h4 id="org323037d"><span class="section-number-4">2.2.4</span> Events</h4>
<div class="outline-text-4" id="text-2-2-4">
<dl class="org-dl">
<dt>GET    /Week:</dt><dd>Obtiene los eventos de cierta semana (Para padres y entrenadores)</dd>
<dt>POST   /Event:</dt><dd>Genera un nuevo evento. (Partidos, Entrenamientos, etc&#x2026;) (Solo Entrenador)</dd>
<dt>PUT    /Event:</dt><dd>Modifica los detalles de un evento. (Entrenador)</dd>
<dt>DELETE /Event:</dt><dd>Borra un evento (Admin)</dd>
</dl>
</div>
</div>
<div id="outline-container-org3c54383" class="outline-4">
<h4 id="org3c54383"><span class="section-number-4">2.2.5</span> Padres</h4>
<div class="outline-text-4" id="text-2-2-5">
<dl class="org-dl">
<dt>POST /Hijo:</dt><dd>Registra un nuevo hijo</dd>
<dt>PUT  /Contact:</dt><dd>Modifica información de contacto</dd>
<dt>PUT  /Invitation Status:</dt><dd>Actualizar el estatus de Invitación (Aceptada/ Rechazada)</dd>
<dt>GET  /HijoDashboard:</dt><dd>Cambia de vista de hijo</dd>
</dl>
</div>
</div>
<div id="outline-container-org5e742c7" class="outline-4">
<h4 id="org5e742c7"><span class="section-number-4">2.2.6</span> Equipo</h4>
<div class="outline-text-4" id="text-2-2-6">
<dl class="org-dl">
<dt>POST   /Team:</dt><dd>crear un equipo (Admin)</dd>
<dt>GET    /:</dt><dd>Visualiza el directorio del equipo</dd>
<dt>DELETE /:</dt><dd>borra un equipo determinado (Administrador)</dd>
</dl>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ricardo Vela</p>
<p class="date">Created: 2020-04-14 Tue 10:35</p>
</div>
</body>
</html>
